Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОбъектыНаБерегах Расход
	Движения.ОбъектыНаБерегах.Записывать = Истина;
	Движение = Движения.ОбъектыНаБерегах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Пассажир = Пассажир;
	Движение.Берег = БерегОт;
	Движение.Количество = 1;
	
	//регистр ОбъектНаБерегах Приход
	Движения.ОбъектыНаБерегах.Записывать = Истина;
	Движение = Движения.ОбъектыНаБерегах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Пассажир = Пассажир;
	Движение.Берег = БерегДо;
	Движение.Количество = 1;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"Выбрать
		|	ОбъектыНаБерегахОстатки.Пассажир КАК Пассажир,
		|	ОбъектыНаБерегахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОбъектыНаБерегах.Остатки(
		|			,
		|			Берег = &Берег)
		|			КАК ОбъектыНаБерегахОстатки
		|ГДЕ
		|	ОбъектыНаБерегахОстатки.КоличествоОстаток < 0";
		
	Запрос.УстановитьПараметр("Берег", БерегОт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщить("На берегу ''" + БерегОт + "'' не хватает пассажира ''" + Пассажир + "''!");
	КонецЕсли;
	
КонецПроцедуры